<?php


$lang['imglib_source_image_required'] = "Вы должны указать исходное изображение в настройках.";
$lang['imglib_gd_required'] = "Для этой функции требуется библиотека изображений GD.";
$lang['imglib_gd_required_for_props'] = "Ваш сервер должен поддерживать библиотеку изображений GD для определения свойств изображения.";
$lang['imglib_unsupported_imagecreate'] = "Ваш сервер не поддерживает функцию GD, необходимую для обработки этого типа изображения.";
$lang['imglib_gif_not_supported'] = "Изображения GIF часто не поддерживаются из-за лицензионных ограничений. Вместо этого используйте изображения JPG или PNG.";
$lang['imglib_jpg_not_supported'] = "Изображения JPG не поддерживаются.";
$lang['imglib_png_not_supported'] = "Изображения PNG не поддерживаются.";
$lang['imglib_jpg_or_png_required'] = "Протокол изменения размера изображения, указанный в настройках, работает только с типами изображений JPEG или PNG.";
$lang['imglib_copy_error'] = "При попытке заменить файл произошла ошибка. Убедитесь, что ваш каталог файлов доступен для записи.";
$lang['imglib_rotate_unsupported'] = "Поворот изображения не поддерживается вашим сервером.";
$lang['imglib_libpath_invalid'] = "Путь к библиотеке изображений указан неверно. Установите правильный путь в настройках изображений.";
$lang['imglib_image_process_failed'] = "Обработка изображения не удалась. Убедитесь, что ваш сервер поддерживает выбранный протокол и что путь к библиотеке изображений указан правильно.";
$lang['imglib_rotation_angle_required'] = "Для поворота изображения необходимо указать угол поворота.";
$lang['imglib_writing_failed_gif'] = "Изображение GIF.";
$lang['imglib_invalid_path'] = "Путь к изображению указан неверно.";
$lang['imglib_copy_failed'] = "Копирование изображения не удалось.";
$lang['imglib_missing_font'] = "Не удалось найти шрифт для использования.";
$lang['imglib_save_failed'] = "Не удалось сохранить изображение. Убедитесь, что изображение и каталог файлов доступны для записи.";


/* End of file imglib_lang.php */
/* Location: ./application/language/RU/imglib_lang.php */
